In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [2]:
data = Series(['one','two',np.nan,'four']) #nan indicates missing value

In [3]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [8]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
data.isnull

<bound method Series.isnull of 0     one
1     two
2     NaN
3    four
dtype: object>

In [9]:
data.dropna() #drop all null values

0     one
1     two
3    four
dtype: object

In [10]:
""" data was a Series object. Now lets see how it works in DataFrame"""

' data was a Series object. Now lets see how it works in DataFrame'

In [12]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dframe

    0   1   2
0   1   2   3
1 NaN   5   6
2   7 NaN   9
3 NaN NaN NaN

In [15]:
clean_dframe = dframe.dropna()
""" Notice that dropna drops all rows with even a single null from the dataframe, So only 1 row remains here"""
clean_dframe

   0  1  2
0  1  2  3

In [17]:
clean_dframe1 = dframe.dropna(how='any')
clean_dframe1

   0  1  2
0  1  2  3

In [19]:
clean_dframe2 = dframe.dropna(how='all')
clean_dframe2 #only columns with all nulls dropped

    0   1  2
0   1   2  3
1 NaN   5  6
2   7 NaN  9

In [21]:
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
npn = np.nan
dframe2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [24]:
dframe2.dropna(thresh=2) #rows with at least 2 datapoints

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9

In [25]:
dframe2.dropna(thresh=3)

   0   1  2   3
0  1   2  3 NaN
1  2 NaN  5   6

In [26]:
dframe2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [28]:
dframe2.fillna(1) #fill all nulls with 1

   0  1  2  3
0  1  2  3  1
1  2  1  5  6
2  1  7  1  9
3  1  1  1  1

In [29]:
dframe2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [30]:
dframe.fillna({0:0, 1:1, 2:2, 3:3}) #different null values filled by column, by passing a dictionary

   0  1  2
0  1  2  3
1  0  5  6
2  7  1  9
3  0  1  2

In [34]:
#dframe2 = dframe2.fillna()
dframe2.fillna(0,inplace=True) #inplace argument modifies the existing object dframe2 itself .. same effect as stmt above

In [33]:
dframe2

   0  1  2  3
0  1  2  3  0
1  2  0  5  6
2  0  7  0  9
3  1  0  0  0